/* eslint-disable react/no-unescaped-entities */
import React from 'react';

const ServicePolicy: React.FC = () => (
    <pre>
        {`
        전자상거래(인터넷사이버몰) 표준약관

        표준약관 제10023호
        (2015. 6. 26. 개정)

        제1조(목적) 이 약관은 eedited(이하 "회사")가 온라인 마켓플레이스(http://www.kmong.com, 이하 "사이트”라고 합니다)를 통하여 제공하는 프로필 관리서비스 및 기타 정보 서비스(이하 "서비스"라고 합니다)와 관련하여 회사와 회원 또는 회사와 비회원 간의 권리와 의무, 책임 사항 및 회원의 서비스 이용 절차에 관한 사항을 규정함을 목적으로 합니다.

        제2조 (약관 등의 명시와 설명 및 개정)

        본 약관은 회사 회원으로 가입하는 시점부터 효력이 발생합니다. 비회원의 경우, 이용 가능한 서비스와 관련된 약관을 적용받습니다.

        가. 회사는 본 약관의 내용과 상호, 연락처 등을 서비스를 이용하고자 하는 자와 회원이 알 수 있도록 서비스가 제공되는 회사 사이트의 초기화면(이하 연결 화면 포함)에 게시합니다.

        나. 회사가 이 약관을 개정하는 경우에는 개정된 약관의 적용일자 및 개정 사유를 명시하여 현행 약관과 함께 그 적용일자 7일(다만, 제5조 가. 2)의 회원에게 불리한 내용으로 변경하는 경우에는 30일) 이전부터 적용일자 전일까지 위 가.항의 방법 또는 기타 방법으로 공지합니다. 개정된 약관은 개정 약관에서 소급효를 부여하지 않는 이상 적용일자 이전으로 소급하여 적용되지 아니합니다.

        다. 이 약관은 회사와 회원 간에 성립되는 서비스 이용계약의 기본약정입니다. 회사는 필요한 경우 특정 서비스에 관하여 적용될 사항(이하 "개별약관"이라고 합니다)을 정하여 미리 공지할 수 있습니다. 회원이 이러한 개별약관에 동의하고 특정 서비스를 이용하는 경우에는 개별약관이 우선적으로 적용되고, 이 약관은 보충적인 효력을 갖습니다. 개별약관의 게시·변경에 관해서는 위 가.항, 나.항을 준용합니다.

        라. 회사는 특정 전문가와 개별적으로 이 약관 및 개별약관(이하 “약관 등”이라고 합니다)에 규정된 내용과 다른 내용의 계약(이하 “개별계약”이라고 합니다)을 체결할 수 있습니다. 이 경우 개별계약이 약관 등에 우선하여 적용됩니다. 회사는 개별계약을 체결한 전문가에게 계약 내용을 서면(전자 문서 포함) 교부하거나 판매관리 화면에서 확인할 수 있도록 합니다.

        제3조 (관련 법령과의 관계)

        가. 이 약관 또는 개별약관에서 정하지 않은 사항은 전자문서 및 전자거래 기본법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 전자상거래 등에서의 소비자보호에 관한 법률, 저작권법, 개인정보 보호법 등 관련 법령의 규정과 일반적인 상관례에 의합니다.

        나. 회원은 회사가 제공하는 서비스를 이용함에 있어서 관련 법령을 준수하여야 하며, 이 약관의 규정을 들어 관련 법령 위반에 대한 면책을 주장할 수 없습니다.

        제4조 (서비스의 종류)

        회사가 회원에게 제공하는 서비스는 다음과 같습니다.

        중개서비스: 회사가 사이트를 통하여 회원 상호 간에 채용이 이루어질 수 있는 사이버 구인구직장소를 온라인으로 제공하는 서비스 및 관련 부가서비스 일체를 말합니다. 회사는 회원의 구직의 촉진을 위한 관련 부가 서비스로서 회원의 이력 노출을 위한 전시권 등 판매촉진 서비스를 유상으로 제공할 수 있습니다.

        제5조 (용어의 정의)

        가. 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.

        1) 서비스: 사이트에서 판매 가능한 상품으로 유형의 제품 혹은 무형의 서비스를 말합니다.

        2) 회원: 이 약관을 승인하고 회사와 서비스 이용계약을 체결한 자를 말합니다. 회원은 서비스 이용목적에 따라 구직자(또는 편집자)와 구인자로 각 구분되며 상호 간 회사가 정하는 바에 따라 전환할 수 있습니다. 구직자와 구인자 모두에게 이 약관이 적용됩니다.

        3) 비회원: 회원 등록을 하지 않고 회사가 제공하는 서비스를 이용하는 자를 말합니다.

        4) 아이디(ID): 회원의 식별과 서비스의 이용을 위하여 회원이 직접 설정(인증) 하고, 회사가 승인하여 등록된 개인식별용 문자열을 말합니다. 간편 가입(타 서비스의 계정 정보를 연동하는 방식) 방식으로 이용을 신청하는 경우, 해당 서비스에 등록된 고유 id로 자동 설정됩니다. 설정된 아이디 주소를 정상적으로 이용할 수 없는 상태인 경우, 거래·공지 등의 중요 알림이 전송되지 않을 수 있으며 그 책임은 전적으로 회원 본인에게 있습니다.

        5) 비밀번호: 회원의 동일성 확인과 회원정보의 보호를 위하여 회원이 설정하고 회사가 승인한 문자 (특수문자 포함)와 숫자의 조합을 말합니다.

        6) 닉네임: 사이트에서 아이디와 함께, 또는 아이디를 대신하여 회원을 식별할 수 있는 정보입니다. 가입시 설정할 수 있으며, 간편 가입 방식으로 이용을 신청하는 경우, 해당 서비스의 닉네임이 적용됩니다. 이 경우, 해당 닉네임이 중복되는 경우 임의의 숫자가 닉네임 뒤에 추가됩니다.

        7) 온라인 마켓플레이스: 서비스를 사고팔 수 있는 가상의 온라인 공간을 말합니다.

        8) 온라인 마켓플레이스 제공 사업자: 서비스 마켓플레이스 및 그 안에서의 부가서비스(광고 서비스 등)를 제공하고, 이에 대한 대가를 받는 사업자 (이하 “회사”라고 합니다)를 말합니다.

        9) 온라인 마켓플레이스 제공 서비스: 회사가 사이트를 통하여 회원들에게 제공하는 회원 간의 중개서비스 및 관련 부가서비스 일체를 말합니다.

        10) 구직자: 구직할 의사로 해당 서비스를 회사가 온라인으로 제공하는 양식에 맞추어 회사의 사이트에 등록하거나 관련 정보를 프로필에 등록한 회원을 의미합니다.

        11) 구인자: 구직자를 채용할 목적으로 서비스를 이용하는 회원을 말합니다.

        나. 위 가항에서 정의되지 않은 이 약관상의 용어의 의미는 개별 약관/운영 정책 및 일반적인 거래 관행에 의합니다.

        제6조 (이용계약의 성립)

        가. "회사"의 서비스 이용계약(이하 "이용계약")은 "회원"이 되고자 하는 자(이하 "가입신청자")가 본 약관과 개인정보처리방침을 읽고 그 내용에 대하여 동의를 한 다음 회원가입 신청을 하고 "회사"가 이러한 신청에 승낙함으로써 성립된다.

        나. 제1항 신청에 있어 "회사"는 "회원"의 종류에 따라 전문기관을 통한 실명확인 및 본인인증을 요청할 수 있다. "회원"은 본인 인증에 필요한 이름, 생년월일, 연락처 등을 제공하여야 한다.

        다. 구글 등 외부 서비스와의 연동을 통해 이용계약을 신청할 경우, 본 약관과 개인정보처리방침, 서비스 제공을 위해 "회사"의 "가입신청자"의 외부 서비스 계정 정보 접근 및 활용에 "동의" 또는 "확인" 버튼을 누르면 "회사"가 승낙함으로써 이용계약이 성립된다.

        제7조 (이용신청의 승낙과 제한)

        가. "회사"는 전조의 규정에 의한 "가입신청자"의 가입신청에 대하여 업무수행상 또는 기술상 지장이 없는 경우에는 원칙적으로 접수 순서에 따라 서비스 이용을 승낙한다.

        나. "회사"는 아래 사항에 해당하는 경우에 대해서는 이용 신청을 승낙하지 아니한다.

        1) 실명이 아니거나 타인의 명의를 이용하여 신청한 경우

        2) 이용계약 신청서의 내용을 허위로 기재한 경우

        다. "회사"는 아래 사항에 해당하는 경우에는 그 신청에 대하여 승낙 제한 사유가 해소될 때까지 승낙을 유보할 수 있다.

        1) "회사"가 설비의 여유가 없는 경우

        2) "회사"의 기술상 지장이 있는 경우

        3) 기타 "회사"의 귀책 사유로 이용 승낙이 곤란한 경우

        제8조 (이용계약의 종료)

        가. 회원 또는 회사는 이 약관에서 정한 절차에 따라 이용계약을 해지할 수 있습니다.

        나. 회원의 해지

        1) 회원은 언제든지 회사에게 해지 의사를 통지함으로써 이용계약을 해지할 수 있습니다. 회사는 온라인으로 이용계약을 해지할 수 있는 절차를 제공합니다. 다만, 의뢰인은 해지 의사를 통지하기 전 모든 구매 중인 절차를 완료, 철회 또는 취소해야만 하며, 전문가는 해지 의사를 통지하기 전 진행 중인 모든 판매 절차를 마무리하고 서비스 이용에 따른 회사에 대한 채무를 정산하여야 합니다. 이 경우 거래 건의 철회 또는 취소로 인한 불이익은 회원 본인이 부담하여야 합니다.

        2) 이용계약은 회원의 해지 의사가 회사에 도달한 때에 종료됩니다. 다만 회원이 제1)항의 조치를 마치지 않은 경우 위 1)항의 조치가 완료된 때에 종료됩니다.

        3) 본 항에 따라 해지를 한 회원은 이 약관이 정하는 회원가입 절차와 관련 조항에 따라 회원으로 다시 가입할 수 있습니다. 다만 회원이 중복 참여가 제한된 판촉 이벤트 중복 참여 등 부정한 목적으로 회원 탈퇴 후 재가입 신청하는 경우 회사는 재가입을 일정 기간 동안 제한할 수 있습니다.

        다. 회사의 해지

        1) 회사는 다음과 같은 사유가 있는 경우, 이용계약을 해지할 수 있습니다. 이 경우 회사는 회원에게 메일(e-mail), 전화, 팩스 기타의 방법을 통하여 해지 사유를 밝혀 해지 의사를 통지합니다. 이 경우  회사는 해당 회원에게 사전에 해지 사유에 대한 의견 진술의 기회를 부여할 수 있습니다.

        ① 회원에게 제7조 나항에서 정하고 있는 이용 신청의 승낙 거부 사유가 있음이 확인된 경우

        ② 회원이 공공질서 및 미풍양속에 위배되는 서비스 이용 행위를 하거나 시도한 경우

        ③ 회원이 회사나 다른 회원 기타 타인의 권리나 명예, 신용 기타 정당한 이익을 침해하는 행위를 한 경우

        ④ 기타 회원이 이 약관에 위배되는 행위를 하거나 이 약관에서 정한 해지 사유가 발생한 경우

        2) 이용계약은 회사의 해지 의사가 회원에게 도달한 때에 종료되나, 회원이 제공한 연락처 정보의 오류로 인하여 회사가 해지 의사를 통지할 수 없는 경우에는 회사가 사이트에 해지 의사를 공지하는 시점으로부터 3일 이후 종료됩니다. 이 경우 공지 시점부터 회원의 권리는 모두 중지, 소멸되고 3일 이전에 권리를 회복할 사유가 발생하면 소급해서 권리가 회복됩니다.

        라. 이용계약이 종료되는 경우, 회사는 해당 회원의 현금성 예치금 및 수익금을 모두 정산 후, 잔존 금액을 회사는 해당 회원이 지정한 입금계좌로 그 금액을 즉시 송금하여 계약 종료 처리합니다.

        마. 이용계약이 종료된 시점에서, 이미 구매확정된 거래 건에 대한 분쟁이 발생될 경우 이에 대한 책임은 회원이 부담하여야 하고, 회사는 회사의 고의 또는 과실이 없는 한 책임이 없습니다.

        제9조 (서비스 이용시간)

        가. "회사"는 특별한 사유가 없는 한 연중무휴, 1일 24시간 서비스를 제공한다. 다만, "회사"는 서비스의 종류나 성질에 따라 제공하는 서비스 중 일부에 대해서는 별도로 이용시간을 정할 수 있으며, 이 경우 "회사"는 그 이용시간을 사전에 "회원"에게 공지 또는 통지하여야 한다.

        나. "회사"는 자료의 가공과 갱신을 위한 시스템 작업시간, 장애해결을 위한 보수작업 시간, 회선 장애 등이 발생한 경우 일시적으로 서비스를 중단할 수 있으며 계획된 작업의 경우 공지란에 서비스 중단 시간과 작업 내용을 알려야 한다.

        제10조 (서비스 제공의 중지)

        "회사"는 다음 각 호에 해당하는 경우 서비스의 제공을 중지할 수 있다.

        가. 설비의 보수 등 "회사"의 필요에 의해 사전에 "회원"들에게 통지한 경우

        나. 기간통신사업자가 전기통신서비스 제공을 중지하는 경우

        다. 기타 불가항력적인 사유에 의해 서비스 제공이 객관적으로 불가능한 경우

        제11조 (게시물의 관리)

        가. "회원"의 게시물이 정보통신망법 및 저작권법 등 관련법에 위반되는 내용을 포함하는 경우, 권리자는 관련법이 정한 절차에 따라 해당 "게시물"의 게시중단 및 삭제 등을 요청할 수 있으며, "회사"는 관련법에 따라 조치를 취하여야 한다.

        나. "회사"는 전항에 따른 권리자의 요청이 없는 경우라도 권리침해가 인정될 만한 사유가 있거나 기타 "회사" 정책 및 관련법에 위반되는 경우에는 관련법에 따라 해당 "게시물"에 대해 임시조치 등을 취할 수 있다.

        다. 본 조에 따른 세부절차는 "정보통신망법" 및 "저작권법"이 규정한 범위 내에서 "회사"가 정한 "게시중단요청서비스"절차에 따른다.

        제12조 (권리의 귀속)

        가. "서비스"에 대한 저작권 및 지적재산권은 "회사"에 귀속된다. 단, "회원"의 게시물 및 제휴계약에 따라 제공된 저작물 등은 제외된다.

        나. "회사"는 서비스와 관련하여 "회원"에게 "회사"가 정한 이용조건에 따라 계정, 아이디, 콘텐츠 등을 이용할 수 있는 이용권만을 부여하며, "회원"은 이를 양도, 판매, 담보제공 등의 처분행위를 할 수 없다.

        제13조 ("회사"의 의무)

        가. "회사"는 본 약관에서 정한 바에 따라 계속적, 안정적으로 서비스를 제공할 수 있도록 최선의 노력을 다해야 한다.

        나. "회사"는 서비스와 관련한 "회원"의 불만사항이 접수되는 경우 이를 즉시 처리하여야 하며, 즉시 처리가 곤란한 경우에는 그 사유와 처리일정을 서비스 또는 기타 방법을 통해 동 "회원"에게 통지하여야 한다.

        다. 천재지변 등 예측하지 못한 일이 발생하거나 시스템의 장애가 발생하여 서비스가 중단될 경우 이에 대한 손해에 대해서는 "회사"가 책임을 지지 않는다. 다만 자료의 복구나 정상적인 서비스 지원이 되도록 최선을 다할 의무를 진다.

        제14조 (회원의 의무)

        가. "회원"은 관계법령과 본 약관의 규정 및 기타 "회사"가 통지하는 사항을 준수하여야 하며, 기타 "회사"의 업무에 방해되는 행위를 해서는 안 된다.

        나. "회원"은 서비스를 이용하여 얻은 정보를 "회사"의 사전동의 없이 복사, 복제, 번역, 출판, 방송 기타의 방법으로 사용하거나 이를 타인에게 제공할 수 없다.

        다. "회원"은 본 서비스를 포트폴리오 관리 및 건전한 취업 및 이직 이외의 목적으로 사용해서는 안되며 이용 중 다음 각 호의 행위를 해서는 안 된다.

        1) 다른 회원의 아이디를 부정 사용하는 행위

        2) 범죄행위를 목적으로 하거나 기타 범죄행위와 관련된 행위

        3) 타인의 명예를 훼손하거나 모욕하는 행위

        4) 타인의 지적재산권 등의 권리를 침해하는 행위

        5) 해킹행위 또는 바이러스의 유포 행위

        6) 타인의 의사에 반하여 광고성 정보 등 일정한 내용을 계속적으로 전송하는 행위

        7) 서비스의 안정적인 운영에 지장을 주거나 줄 우려가 있다고 판단되는 행위

        8) 사이트의 정보 및 서비스를 이용한 영리 행위

        9) 그밖에 선량한 풍속, 기타 사회질서를 해하거나 관계법령을 위반하는 행위

        제15조 (손해배상)

        1. "회사"가 "회원"에게 손해를 입히거나 기타 "회사"가 제공하는 모든 서비스와 관련하여 "회사"의 책임 있는 사유로 인해 이용자에게 손해가 발생한 경우 "회사"는 그 손해를 배상하여야 한다.

        2. "회원"이 이 약관의 규정에 위반한 행위로 "회사" 및 제3자에게 손해를 입히거나 "회원"의 책임 있는 사유에 의해 "회사" 및 제3자에게 손해를 입힌 경우에는 "회원"은 그 손해를 배상하여야 한다.

        3. 타 회원의 귀책사유로 "회원"의 손해가 발생한 경우 "회사"는 이에 대한 배상 책임이 없다.

        제16조 ("회원"의 개인정보보호)

        "회사"는 "회원"의 개인정보보호를 위하여 노력해야 한다. "회원"의 개인정보보호에 관해서는 정보통신망법 및 관계법령에 따르고, "사이트"에 "개인정보처리방침"을 고지한다.

        제17조 (분쟁의 해결)

        1. "회사"와 "회원"은 서비스와 관련하여 발생한 분쟁을 원만하게 해결하기 위하여 필요한 모든 노력을 하여야 한다.

        2. 전항의 노력에도 불구하고, 동 분쟁에 관한 소송은 민사소송법상 관할법원에 제소한다.`}
    </pre>
);

export default ServicePolicy;
